# Reference Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Reference Members
Reference Class Constructors Methods Properties See Also
---
The Reference type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Reference | Creates a Reference with the supplied element. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Contains | Checks if given reference identifies part of object identified by this reference. |
| ConvertToStableRepresentation | Converts the reference to a stable String representation. |
| CreateLinkReference | Creates a Reference from a Reference in an RVT Link. |
| CreateReferenceInLink | Creates a Reference in an RVT Link from a Reference in the RVT host file. |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| EqualTo | Checks if given reference is equal to this reference. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ParseFromStableRepresentation | Converts a stable String representation of a reference to a Reference object. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementId | The element id for this reference. |
| ElementReferenceType | The type of reference. |
| GlobalPoint | The position on which the reference is hit. |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| LinkedElementId | The id of the top-level element in the linked document that is referred to by this reference. |
| UVPoint | The UV parameters of the reference, if the reference contains a face. |

# See Also
Reference Class
Autodesk.Revit.DB Namespace